CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_rtc.h
/* bits definitions */
/* RTC_TIME */
#define RTC_TIME_SCU                       BITS(0,3)                            /*!< second units in BCD code */
#define RTC_TIME_SCT                       BITS(4,6)                            /*!< second tens in BCD code */
#define RTC_TIME_MNU                       BITS(8,11)                           /*!< minute units in BCD code */
#define RTC_TIME_MNT                       BITS(12,14)                          /*!< minute tens in BCD code */
#define RTC_TIME_HRU                       BITS(16,19)                          /*!< hour units in BCD code */
#define RTC_TIME_HRT                       BITS(20,21)                          /*!< hour tens in BCD code */
#define RTC_TIME_PM                        BIT(22)                              /*!< AM/PM notation */
/* RTC_DATE */
#define RTC_DATE_DAYU                      BITS(0,3)                            /*!< date units in BCD code */
#define RTC_DATE_DAYT                      BITS(4,5)                            /*!< date tens in BCD code */
#define RTC_DATE_MONU                      BITS(8,11)                           /*!< month units in BCD code */
#define RTC_DATE_MONT                      BIT(12)                              /*!< month tens in BCD code */
#define RTC_DATE_DOW                       BITS(13,15)                          /*!< day of week units */
#define RTC_DATE_YRU                       BITS(16,19)                          /*!< year units in BCD code */
#define RTC_DATE_YRT                       BITS(20,23)                          /*!< year tens in BCD code */
/* RTC_CTL */
#define RTC_CTL_WTCS                       BITS(0,2)                            /*!< auto wakeup timer clock selection */
#define RTC_CTL_TSEG                       BIT(3)                               /*!< valid event edge of time-stamp */
#define RTC_CTL_REFEN                      BIT(4)                               /*!< reference clock detection function enable */
#define RTC_CTL_BPSHAD                     BIT(5)                               /*!< shadow registers bypass control */
#define RTC_CTL_CS                         BIT(6)                               /*!< display format of clock system */
#define RTC_CTL_CCEN                       BIT(7)                               /*!< coarse calibration function enable */
#define RTC_CTL_ALRM0EN                    BIT(8)                               /*!< alarm0 function enable */
#define RTC_CTL_ALRM1EN                    BIT(9)                               /*!< alarm1 function enable */
#define RTC_CTL_WTEN                       BIT(10)                              /*!< auto wakeup timer function enable */
#define RTC_CTL_TSEN                       BIT(11)                              /*!< time-stamp function enable */
#define RTC_CTL_ALRM0IE                    BIT(12)                              /*!< RTC alarm0 interrupt enable */
#define RTC_CTL_ALRM1IE                    BIT(13)                              /*!< RTC alarm1 interrupt enable */
#define RTC_CTL_WTIE                       BIT(14)                              /*!< auto wakeup timer interrupt enable */
#define RTC_CTL_TSIE                       BIT(15)                              /*!< time-stamp interrupt enable */
#define RTC_CTL_A1H                        BIT(16)                              /*!< add 1 hour(summer time change) */
#define RTC_CTL_S1H                        BIT(17)                              /*!< subtract 1 hour(winter time change) */
#define RTC_CTL_DSM                        BIT(18)                              /*!< daylight saving mark */
#define RTC_CTL_COS                        BIT(19)                              /*!< calibration output selection */
#define RTC_CTL_OPOL                       BIT(20)                              /*!< output polarity */
#define RTC_CTL_OS                         BITS(21,22)                          /*!< output selection */
#define RTC_CTL_COEN                       BIT(23)                              /*!< calibration output enable */
#define RTC_CTL_OUT2EN                     BIT(31)                              /*!< RTC_OUT pin select */
/* RTC_ICS */
#define RTC_ICS_ALRM0WF                   BIT(0)                               /*!< alarm0 configuration can be write flag */
#define RTC_ICS_ALRM1WF                   BIT(1)                               /*!< alarm1 configuration can be write flag */
#define RTC_ICS_WTWF                      BIT(2)                               /*!< wakeup timer can be write flag */
#define RTC_ICS_SOPF                      BIT(3)                               /*!< shift function operation pending flag */
#define RTC_ICS_YCM                       BIT(4)                               /*!< year configuration mark status flag */
#define RTC_ICS_RSYNF                     BIT(5)                               /*!< register synchronization flag */
#define RTC_ICS_INITF                     BIT(6)                               /*!< initialization state flag */
#define RTC_ICS_INITM                     BIT(7)                               /*!< enter initialization mode */
#define RTC_ICS_SCPF                      BIT(16)                              /*!< smooth calibration pending flag */
/* RTC_PSC */
#define RTC_PSC_FACTOR_S                   BITS(0,14)                           /*!< synchronous prescaler factor */
#define RTC_PSC_FACTOR_A                   BITS(16,22)                          /*!< asynchronous prescaler factor */
/* RTC_WUT */
#define RTC_WUT_WTRV                       BITS(0,15)                           /*!< auto wakeup timer reloads value */
/* RTC_COSC */
#define RTC_COSC_COSS                      BITS(0,4)                            /*!< coarse calibration step */
#define RTC_COSC_COSD                      BIT(7)                               /*!< coarse calibration direction */
/* RTC_ALRMxTD */
#define RTC_ALRMXTD_SCU                    BITS(0,3)                            /*!< second units in BCD code */
#define RTC_ALRMXTD_SCT                    BITS(4,6)                            /*!< second tens in BCD code */
#define RTC_ALRMXTD_MSKS                   BIT(7)                               /*!< alarm second mask bit */
#define RTC_ALRMXTD_MNU                    BITS(8,11)                           /*!< minutes units in BCD code */
#define RTC_ALRMXTD_MNT                    BITS(12,14)                          /*!< minutes tens in BCD code */
#define RTC_ALRMXTD_MSKM                   BIT(15)                              /*!< alarm minutes mask bit */
#define RTC_ALRMXTD_HRU                    BITS(16,19)                          /*!< hour units in BCD code */
#define RTC_ALRMXTD_HRT                    BITS(20,21)                          /*!< hour tens in BCD code */
#define RTC_ALRMXTD_PM                     BIT(22)                              /*!< AM/PM flag */
#define RTC_ALRMXTD_MSKH                   BIT(23)                              /*!< alarm hour mask bit */
#define RTC_ALRMXTD_DAYU                   BITS(24,27)                          /*!< date units or week day in BCD code */
#define RTC_ALRMXTD_DAYT                   BITS(28,29)                          /*!< date tens in BCD code */
#define RTC_ALRMXTD_DOWS                   BIT(30)                              /*!< day of week  selection */
#define RTC_ALRMXTD_MSKD                   BIT(31)                              /*!< alarm date mask bit */
/* RTC_WPK */
#define RTC_WPK_WPK                        BITS(0,7)                            /*!< key for write protection */
/* RTC_SS */
#define RTC_SS_SSC                         BITS(0,15)                           /*!< sub second value */
/* RTC_SHIFTCTL */
#define RTC_SHIFTCTL_SFS                   BITS(0,14)                           /*!< subtract a fraction of a second */
#define RTC_SHIFTCTL_A1S                   BIT(31)                              /*!< one second add */
/* RTC_TTS */
#define RTC_TTS_SCU                        BITS(0,3)                            /*!< second units in BCD code */
#define RTC_TTS_SCT                        BITS(4,6)                            /*!< second tens in BCD code */
#define RTC_TTS_MNU                        BITS(8,11)                           /*!< minute units in BCD code */
#define RTC_TTS_MNT                        BITS(12,14)                          /*!< minute tens in BCD code */
#define RTC_TTS_HRU                        BITS(16,19)                          /*!< hour units in BCD code */
#define RTC_TTS_HRT                        BITS(20,21)                          /*!< hour tens in BCD code */
#define RTC_TTS_PM                         BIT(22)                              /*!< AM/PM notation */
/* RTC_DTS */
#define RTC_DTS_DAYU                       BITS(0,3)                            /*!< date units in BCD code */
#define RTC_DTS_DAYT                       BITS(4,5)                            /*!< date tens in BCD code */
#define RTC_DTS_MONU                       BITS(8,11)                           /*!< month units in BCD code */
#define RTC_DTS_MONT                       BIT(12)                              /*!< month tens in BCD code */
#define RTC_DTS_DOW                        BITS(13,15)                          /*!< day of week units */
/* RTC_SSTS */
#define RTC_SSTS_SSC                       BITS(0,15)                           /*!< timestamp sub second units */
/* RTC_HRFC */
#define RTC_HRFC_CMSK                      BITS(0,8)                            /*!< calibration mask number */
#define RTC_HRFC_CWND16                    BIT(13)                              /*!< frequency compensation window 16 second selected */
#define RTC_HRFC_CWND8                     BIT(14)                              /*!< frequency compensation window 8 second selected */
#define RTC_HRFC_FREQI                     BIT(15)                              /*!< increase RTC frequency by 488.5ppm */
/* RTC_TAMP */
#define RTC_TAMP_TP0EN                     BIT(0)                               /*!< tamper 0 detection enable */
#define RTC_TAMP_TP0EG                     BIT(1)                               /*!< tamper 0 event trigger edge for RTC tamp 0 input */
#define RTC_TAMP_TPIE                      BIT(2)                               /*!< tamper detection interrupt enable */
#define RTC_TAMP_TP1EN                     BIT(3)                               /*!< tamper 1 detection enable */
#define RTC_TAMP_TP1EG                     BIT(4)                               /*!< tamper 1 event trigger edge for RTC tamp 1 input */
#define RTC_TAMP_TPTS                      BIT(7)                               /*!< make tamper function used for timestamp function */
#define RTC_TAMP_FREQ                      BITS(8,10)                           /*!< sample frequency of tamper event detection */
#define RTC_TAMP_FLT                       BITS(11,12)                          /*!< RTC tamp x filter count setting */
#define RTC_TAMP_PRCH                      BITS(13,14)                          /*!< precharge duration time of RTC tamp x */
#define RTC_TAMP_DISPU                     BIT(15)                              /*!< RTC tamp x pull up disable bit */
#define RTC_TAMP_AOT                       BIT(18)                              /*!< RTC_ALARM output Type */
#define RTC_TAMP_TP0NOER                   BIT(19)                              /*!< Tamper 0 event does not erase the backup registers */
#define RTC_TAMP_TP1NOER                   BIT(20)                              /*!< Tamper 1 event does not erase the backup registers */
#define RTC_TAMP_BKERASE                   BIT(31)                              /*!< software backup registers erase */
/* RTC_ALRM0SS */
#define RTC_ALRM0SS_SSC                    BITS(0,14)                           /*!< alarm0 sub second value */
#define RTC_ALRM0SS_MSKSSC                 BITS(24,27)                          /*!< mask control bit of SSC */
/* RTC_ALRM1SS */
#define RTC_ALRM1SS_SSC                    BITS(0,14)                           /*!< alarm1 sub second value */
#define RTC_ALRM1SS_MSKSSC                 BITS(24,27)                          /*!< mask control bit of SSC */
/* RTC_PPM_CTL */
#define RTC_PPM_CTL_ALRM0PRIP              BIT(0)                               /*!< Alarm 0 privilege protection */
#define RTC_PPM_CTL_ALRM1PRIP              BIT(1)                               /*!< Alarm 1 privilege protection */
#define RTC_PPM_CTL_WUTPRIP                BIT(2)                               /*!< Wakeup timer privilege protection */
#define RTC_PPM_CTL_TSPRIP                 BIT(3)                               /*!< Timestamp privilege protection */
#define RTC_PPM_CTL_TAMPPRIP               BIT(12)                              /*!< Tamper privilege protection (excluding backup registers) */
#define RTC_PPM_CTL_CALCPRIP               BIT(13)                              /*!< Shift register, daylight saving, calibration and reference clock privilege protection */
#define RTC_PPM_CTL_INITPRIP               BIT(14)                              /*!< Initialization privilege protection */
#define RTC_PPM_CTL_RTCPRIP                BIT(15)                              /*!< RTC privilege protection */
#define RTC_PPM_CTL_BKPRWPRIP              BIT(30)                              /*!< backup registers zone 1 privilege protection */
#define RTC_PPM_CTL_BKPWPRIP               BIT(31)                              /*!< backup registers zone 2 privilege protection */
/* RTC_SPM_CTL */
#define RTC_SPM_CTL_ALRM0SECP              BIT(0)                               /*!< Alarm 0 protection */
#define RTC_SPM_CTL_ALRM1SECP              BIT(1)                               /*!< Alarm 1 protection */
#define RTC_SPM_CTL_WUTSECP                BIT(2)                               /*!< Wakeup timer protection */
#define RTC_SPM_CTL_TSSECP                 BIT(3)                               /*!< Timestamp protection */
#define RTC_SPM_CTL_TAMPSECP               BIT(12)                              /*!< Tamper protection (excluding backup registers) */
#define RTC_SPM_CTL_CALCSECP               BIT(13)                              /*!< Shift register, daylight saving, calibration and reference clock protection */
#define RTC_SPM_CTL_INITSECP               BIT(14)                              /*!< Initialization protection  */
#define RTC_SPM_CTL_RTCSECP                BIT(15)                              /*!< RTC global protection */
#define RTC_SPM_CTL_BKPRWSECP              BITS(16,23)                          /*!< Backup registers read/write protection offset */
#define RTC_SPM_CTL_BKPWSECP               BITS(24,31)                          /*!< Backup registers write protection offset */
/* RTC_STAT */
#define RTC_STAT_ALRM0F                    BIT(0)                               /*!< alarm0 occurs flag */
#define RTC_STAT_ALRM1F                    BIT(1)                               /*!< alarm1 occurs flag */
#define RTC_STAT_WTF                       BIT(2)                               /*!< wakeup timer occurs flag */
#define RTC_STAT_TSF                       BIT(3)                               /*!< time-stamp flag */
#define RTC_STAT_TSOVRF                    BIT(4)                               /*!< time-stamp overflow flag */
#define RTC_STAT_TP0F                      BIT(16)                              /*!< RTC tamper 0 detected flag */
#define RTC_STAT_TP1F                      BIT(17)                              /*!< RTC tamper 1 detected flag */
/* RTC_NSMI_STAT */
#define RTC_NSMI_STAT_ALRM0NSMF            BIT(0)                               /*!< alarm0 non-secure interrupt masked flag */
#define RTC_NSMI_STAT_ALRM1NSMF            BIT(1)                               /*!< alarm1 non-secure interrupt masked flag */
#define RTC_NSMI_STAT_WTNSMF               BIT(2)                               /*!< wakeup timer non-secure interrupt masked flag */
#define RTC_NSMI_STAT_TSNSMF               BIT(3)                               /*!< time-stamp non-secure interrupt masked flag */
#define RTC_NSMI_STAT_TSOVRNSMF            BIT(4)                               /*!< Time-stamp overflow non-secure interrupt masked flag */
#define RTC_NSMI_STAT_TP0NSMF              BIT(16)                              /*!< RTC_TAMP0 non-secure interrupt masked flag */
#define RTC_NSMI_STAT_TP1NSMF              BIT(17)                              /*!< RTC_TAMP1 non-secure interrupt masked flag */
/* RTC_SMI_STAT */
#define RTC_SMI_STAT_ALRM0SMF              BIT(0)                               /*!< alarm0 secure interrupt masked flag */
#define RTC_SMI_STAT_ALRM1SMF              BIT(1)                               /*!< alarm1 secure interrupt masked flag */
#define RTC_SMI_STAT_WTSMF                 BIT(2)                               /*!< wakeup timer secure interrupt masked flag */
#define RTC_SMI_STAT_TSSMF                 BIT(3)                               /*!< time-stamp secure interrupt masked flag */
#define RTC_SMI_STAT_TSOVRSMF              BIT(4)                               /*!< Time-stamp overflow secure interrupt masked flag */
#define RTC_SMI_STAT_TP0SMF                BIT(16)                              /*!< RTC_TAMP0 secure interrupt masked flag */
#define RTC_SMI_STAT_TP1SMF                BIT(17)                              /*!< RTC_TAMP1 secure interrupt masked flag */
/* RTC_STATC */
#define RTC_STATC_ALRM0FC                  BIT(0)                               /*!< alarm0 flag clear */
#define RTC_STATC_ALRM1FC                  BIT(1)                               /*!< alarm1 flag clear */
#define RTC_STATC_WTFC                     BIT(2)                               /*!< wakeup timer flag clear */
#define RTC_STATC_TSFC                     BIT(3)                               /*!< time-stamp flag clear */
#define RTC_STATC_TSOVRFC                  BIT(4)                               /*!< Time-stamp overflow flag clear */
#define RTC_STATC_TP0FC                    BIT(16)                              /*!< RTC_TAMP0 detection flag clear */
#define RTC_STATC_TP1FC                    BIT(17)                              /*!< RTC_TAMP1 detection flag clear */

/* constants definitions */
/* structure for initialization of the RTC */
typedef struct
{
    uint8_t year;                                                               /*!< RTC year value: 0x0 - 0x99(BCD format) */
    uint8_t month;                                                              /*!< RTC month value */
    uint8_t date;                                                               /*!< RTC date value: 0x1 - 0x31(BCD format) */
    uint8_t day_of_week;                                                        /*!< RTC weekday value */
    uint8_t hour;                                                               /*!< RTC hour value */
    uint8_t minute;                                                             /*!< RTC minute value: 0x0 - 0x59(BCD format) */
    uint8_t second;                                                             /*!< RTC second value: 0x0 - 0x59(BCD format) */
    uint16_t factor_asyn;                                                       /*!< RTC asynchronous prescaler value: 0x0 - 0x7F */
    uint16_t factor_syn;                                                        /*!< RTC synchronous prescaler value: 0x0 - 0x7FFF */
    uint32_t am_pm;                                                             /*!< RTC AM/PM value */
    uint32_t display_format;                                                    /*!< RTC time notation */
}rtc_parameter_struct;
/* structure for RTC alarm configuration */
typedef struct
{
    uint32_t alarm_mask;                                                        /*!< RTC alarm mask */
    uint32_t weekday_or_date;                                                   /*!< specify RTC alarm is on date or weekday */
    uint8_t alarm_day;                                                          /*!< RTC alarm date or weekday value*/
    uint8_t alarm_hour;                                                         /*!< RTC alarm hour value */
    uint8_t alarm_minute;                                                       /*!< RTC alarm minute value: 0x0 - 0x59(BCD format) */
    uint8_t alarm_second;                                                       /*!< RTC alarm second value: 0x0 - 0x59(BCD format) */
    uint32_t am_pm;                                                             /*!< RTC alarm AM/PM value */
}rtc_alarm_struct;
/* structure for RTC time-stamp configuration */
typedef struct
{
    uint8_t timestamp_month;                                                    /*!< RTC time-stamp month value */
    uint8_t timestamp_date;                                                     /*!< RTC time-stamp date value: 0x1 - 0x31(BCD format) */
    uint8_t timestamp_day;                                                      /*!< RTC time-stamp weekday value */
    uint8_t timestamp_hour;                                                     /*!< RTC time-stamp hour value */
    uint8_t timestamp_minute;                                                   /*!< RTC time-stamp minute value: 0x0 - 0x59(BCD format) */
    uint8_t timestamp_second;                                                   /*!< RTC time-stamp second value: 0x0 - 0x59(BCD format) */
    uint32_t am_pm;                                                             /*!< RTC time-stamp AM/PM value */
}rtc_timestamp_struct;
