CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_rtc.h
#define RTC_CALIBRATION_WINDOW_32S         ((uint32_t)0x00000000U)                    /*!< 2exp20 RTCCLK cycles, 32s if RTCCLK = 32768 Hz */
#define RTC_CALIBRATION_WINDOW_16S         RTC_HRFC_CWND16                            /*!< 2exp19 RTCCLK cycles, 16s if RTCCLK = 32768 Hz */
#define RTC_CALIBRATION_WINDOW_8S          RTC_HRFC_CWND8                             /*!< 2exp18 RTCCLK cycles, 8s if RTCCLK = 32768 Hz */

#define RTC_CALIBRATION_PLUS_SET           RTC_HRFC_FREQI                             /*!< increase RTC frequency by 488.5ppm */
#define RTC_CALIBRATION_PLUS_RESET         ((uint32_t)0x00000000U)                    /*!< no effect */

/* tamp register value */
#define TAMP_TAMPXNOER(regval)             (BITS(19,20) & ((uint32_t)(regval) << 19))  /*!< write value to RTC_TAMP_TAMPXNOER bits field */
#define RTC_TAMPXNOER_NONE                 TAMP_TAMPXNOER(0)                           /*!< both tamper0 and tamper1 event will trigger RTC_BKP registers reset */
#define RTC_TAMPXNOER_TP0                  TAMP_TAMPXNOER(1)                           /*!< tamper0 event will not trigger RTC_BKP registers reset */
#define RTC_TAMPXNOER_TP1                  TAMP_TAMPXNOER(2)                           /*!< tamper1 event will not trigger RTC_BKP registers reset */
#define RTC_TAMPXNOER_TP0_TP1              TAMP_TAMPXNOER(3)                           /*!< Neither tamper0 nor tamepr1 event will trigger RTC_BKP registers reset */

#define TAMP_PRCH(regval)                  (BITS(13,14) & ((uint32_t)(regval) << 13))  /*!< write value to RTC_TAMP_PRCH bit field */
#define RTC_PRCH_1C                        TAMP_PRCH(0)                                /*!< 1 RTC clock prechagre time before each sampling */
#define RTC_PRCH_2C                        TAMP_PRCH(1)                                /*!< 2 RTC clock prechagre time before each sampling  */
#define RTC_PRCH_4C                        TAMP_PRCH(2)                                /*!< 4 RTC clock prechagre time before each sampling */
#define RTC_PRCH_8C                        TAMP_PRCH(3)                                /*!< 8 RTC clock prechagre time before each sampling */

#define TAMP_FLT(regval)                   (BITS(11,12) & ((uint32_t)(regval) << 11))  /*!< write value to RTC_TAMP_FLT bit field */
#define RTC_FLT_EDGE                       TAMP_FLT(0)                                 /*!< detecting tamper event using edge mode. precharge duration is disabled automatically */
#define RTC_FLT_2S                         TAMP_FLT(1)                                 /*!< detecting tamper event using level mode.2 consecutive valid level samples will make a effective tamper event */
#define RTC_FLT_4S                         TAMP_FLT(2)                                 /*!< detecting tamper event using level mode.4 consecutive valid level samples will make an effective tamper event */
#define RTC_FLT_8S                         TAMP_FLT(3)                                 /*!< detecting tamper event using level mode.8 consecutive valid level samples will make a effective tamper event */

#define TAMP_FREQ(regval)                  (BITS(8,10) & ((uint32_t)(regval) << 8))    /*!< write value to RTC_TAMP_FREQ bit field */
#define RTC_FREQ_DIV32768                  TAMP_FREQ(0)                                /*!< sample once every 32768 RTCCLK(1Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV16384                  TAMP_FREQ(1)                                /*!< sample once every 16384 RTCCLK(2Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV8192                   TAMP_FREQ(2)                                /*!< sample once every 8192 RTCCLK(4Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV4096                   TAMP_FREQ(3)                                /*!< sample once every 4096 RTCCLK(8Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV2048                   TAMP_FREQ(4)                                /*!< sample once every 2048 RTCCLK(16Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV1024                   TAMP_FREQ(5)                                /*!< sample once every 1024 RTCCLK(32Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV512                    TAMP_FREQ(6)                                /*!< sample once every 512 RTCCLK(64Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV256                    TAMP_FREQ(7)                                /*!< sample once every 256 RTCCLK(128Hz if RTCCLK=32.768KHz) */

#define RTC_TAMPER0                        RTC_TAMP_TP0EN                              /*!< tamper 0 detection enable */
#define RTC_TAMPER1                        RTC_TAMP_TP1EN                              /*!< tamper 1 detection enable */

#define RTC_TAMPER_TRIGGER_EDGE_RISING     ((uint32_t)0x00000000U)                     /*!< tamper detection is in rising edge mode */
#define RTC_TAMPER_TRIGGER_EDGE_FALLING    RTC_TAMP_TP0EG                              /*!< tamper detection is in falling edge mode */
#define RTC_TAMPER_TRIGGER_LEVEL_LOW       ((uint32_t)0x00000000U)                     /*!< tamper detection is in low level mode */
#define RTC_TAMPER_TRIGGER_LEVEL_HIGH      RTC_TAMP_TP0EG                              /*!< tamper detection is in high level mode */

#define RTC_TAMPER_TRIGGER_POS             ((uint32_t)0x00000001U)                     /* shift position of trigger relative to source */

#define RTC_ALARM_OUTPUT_OD                ((uint32_t)0x00000000U)                     /*!< RTC alarm output open-drain mode */
#define RTC_ALARM_OUTPUT_PP                RTC_TAMP_AOT                                /*!< RTC alarm output push-pull mode */

/* ALRMXSS register value */
#define ALRMXSS_SSC(regval)                (BITS(0,14) & ((uint32_t)(regval)<< 0))     /*!< write value to RTC_ALRMXSS_SSC bit field */

#define ALRMXSS_MSKSSC(regval)             (BITS(24,27) & ((uint32_t)(regval) << 24))  /*!< write value to RTC_ALRMXSS_MSKSSC bit field */
#define RTC_MSKSSC_0_14                    ALRMXSS_MSKSSC(0)                           /*!< mask alarm subsecond configuration */
#define RTC_MSKSSC_1_14                    ALRMXSS_MSKSSC(1)                           /*!< mask RTC_ALRMXSS_SSC[14:1], and RTC_ALRMXSS_SSC[0] is to be compared */
#define RTC_MSKSSC_2_14                    ALRMXSS_MSKSSC(2)                           /*!< mask RTC_ALRMXSS_SSC[14:2], and RTC_ALRMXSS_SSC[1:0] is to be compared */
#define RTC_MSKSSC_3_14                    ALRMXSS_MSKSSC(3)                           /*!< mask RTC_ALRMXSS_SSC[14:3], and RTC_ALRMXSS_SSC[2:0] is to be compared */
#define RTC_MSKSSC_4_14                    ALRMXSS_MSKSSC(4)                           /*!< mask RTC_ALRMXSS_SSC[14:4]], and RTC_ALRMXSS_SSC[3:0] is to be compared */
#define RTC_MSKSSC_5_14                    ALRMXSS_MSKSSC(5)                           /*!< mask RTC_ALRMXSS_SSC[14:5], and RTC_ALRMXSS_SSC[4:0] is to be compared */
#define RTC_MSKSSC_6_14                    ALRMXSS_MSKSSC(6)                           /*!< mask RTC_ALRMXSS_SSC[14:6], and RTC_ALRMXSS_SSC[5:0] is to be compared */
#define RTC_MSKSSC_7_14                    ALRMXSS_MSKSSC(7)                           /*!< mask RTC_ALRMXSS_SSC[14:7], and RTC_ALRMXSS_SSC[6:0] is to be compared */
#define RTC_MSKSSC_8_14                    ALRMXSS_MSKSSC(8)                           /*!< mask RTC_ALRMXSS_SSC[14:8], and RTC_ALRMXSS_SSC[7:0] is to be compared */
#define RTC_MSKSSC_9_14                    ALRMXSS_MSKSSC(9)                           /*!< mask RTC_ALRMXSS_SSC[14:9], and RTC_ALRMXSS_SSC[8:0] is to be compared */
#define RTC_MSKSSC_10_14                   ALRMXSS_MSKSSC(10)                          /*!< mask RTC_ALRMXSS_SSC[14:10], and RTC_ALRMXSS_SSC[9:0] is to be compared */
#define RTC_MSKSSC_11_14                   ALRMXSS_MSKSSC(11)                          /*!< mask RTC_ALRMXSS_SSC[14:11], and RTC_ALRMXSS_SSC[10:0] is to be compared */
#define RTC_MSKSSC_12_14                   ALRMXSS_MSKSSC(12)                          /*!< mask RTC_ALRMXSS_SSC[14:12], and RTC_ALRMXSS_SSC[11:0] is to be compared */
#define RTC_MSKSSC_13_14                   ALRMXSS_MSKSSC(13)                          /*!< mask RTC_ALRMXSS_SSC[14:13], and RTC_ALRMXSS_SSC[12:0] is to be compared */
#define RTC_MSKSSC_14                      ALRMXSS_MSKSSC(14)                          /*!< mask RTC_ALRMXSS_SSC[14], and RTC_ALRMXSS_SSC[13:0] is to be compared */
#define RTC_MSKSSC_NONE                    ALRMXSS_MSKSSC(15)                          /*!< mask none, and RTC_ALRMXSS_SSC[14:0] is to be compared */

/* SPM_CTL register value */
#define SPM_CTL_BKPRWSECP(regval)          (BITS(16,23) & ((uint32_t)(regval) << 16))  /*!< write value to RTC_SPM_CTL_BKPRWSECP bit field */
#define GET_SPM_CTL_BKPRWSECP(regval)      GET_BITS((regval),16,23)                    /*!< get value of RTC_SPM_CTL_BKPRWSECP bit field */
#define RTC_BKP_PRO_ZONEA_TAIL_NONE        SPM_CTL_BKPRWSECP(0)                        /*!< there is no RTC_BKP registers secure protection zonea */
#define RTC_BKP_PRO_ZONEA_TAIL_0           SPM_CTL_BKPRWSECP(1)                        /*!< RTC_BKP registers secure protection zonea is RTC_BKP0, which can be read and written only when the APB is in secure mode */ 
#define RTC_BKP_PRO_ZONEA_TAIL_1           SPM_CTL_BKPRWSECP(2)                        /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP1, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_2           SPM_CTL_BKPRWSECP(3)                        /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP2, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_3           SPM_CTL_BKPRWSECP(4)                        /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP3, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_4           SPM_CTL_BKPRWSECP(5)                        /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP4, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_5           SPM_CTL_BKPRWSECP(6)                        /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP5, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_6           SPM_CTL_BKPRWSECP(7)                        /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP6, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_7           SPM_CTL_BKPRWSECP(8)                        /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP7, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_8           SPM_CTL_BKPRWSECP(9)                        /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP8, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_9           SPM_CTL_BKPRWSECP(10)                       /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP9, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_10          SPM_CTL_BKPRWSECP(11)                       /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP10, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_11          SPM_CTL_BKPRWSECP(12)                       /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP11, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_12          SPM_CTL_BKPRWSECP(13)                       /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP12, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_13          SPM_CTL_BKPRWSECP(14)                       /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP13, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_14          SPM_CTL_BKPRWSECP(15)                       /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP14, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_15          SPM_CTL_BKPRWSECP(16)                       /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP15, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_16          SPM_CTL_BKPRWSECP(17)                       /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP16, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_17          SPM_CTL_BKPRWSECP(18)                       /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP17, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_18          SPM_CTL_BKPRWSECP(19)                       /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP18, which can be read and written only when the APB is in secure mode */
#define RTC_BKP_PRO_ZONEA_TAIL_19          SPM_CTL_BKPRWSECP(20)                       /*!< RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKP19, which can be read and written only when the APB is in secure mode */

#define SPM_CTL_BKPWSECP(regval)           (BITS(24,31) & ((uint32_t)(regval) << 24))  /*!< write value to RTC_SPM_CTL_BKPWSECP bit field */
#define GET_SPM_CTL_BKPWSECP(regval)       GET_BITS((regval),24,31)                    /*!< get value of RTC_SPM_CTL_BKPWSECP bit field */
#define RTC_BKP_PRO_ZONEB_TAIL_NONE        SPM_CTL_BKPWSECP(0)                         /*!< there is no RTC_BKP registers secure protection zoneb */ 
#define RTC_BKP_PRO_ZONEB_TAIL_0           SPM_CTL_BKPWSECP(1)                         /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP0, if there is no RTC_BKP registers secure protection zonea */
#define RTC_BKP_PRO_ZONEB_TAIL_1           SPM_CTL_BKPWSECP(2)                         /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP1, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_2           SPM_CTL_BKPWSECP(3)                         /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP2, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_3           SPM_CTL_BKPWSECP(4)                         /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP3, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_4           SPM_CTL_BKPWSECP(5)                         /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP4, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_5           SPM_CTL_BKPWSECP(6)                         /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP5, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_6           SPM_CTL_BKPWSECP(7)                         /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP6, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_7           SPM_CTL_BKPWSECP(8)                         /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP7, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_8           SPM_CTL_BKPWSECP(9)                         /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP8, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_9           SPM_CTL_BKPWSECP(10)                        /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP9, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_10          SPM_CTL_BKPWSECP(11)                        /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP10, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_11          SPM_CTL_BKPWSECP(12)                        /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP11, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_12          SPM_CTL_BKPWSECP(13)                        /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP12, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_13          SPM_CTL_BKPWSECP(14)                        /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP13, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_14          SPM_CTL_BKPWSECP(15)                        /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP14, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_15          SPM_CTL_BKPWSECP(16)                        /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP15, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_16          SPM_CTL_BKPWSECP(17)                        /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP16, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_17          SPM_CTL_BKPWSECP(18)                        /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP17, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_18          SPM_CTL_BKPWSECP(19)                        /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP18, if zoneb is valid */
#define RTC_BKP_PRO_ZONEB_TAIL_19          SPM_CTL_BKPWSECP(20)                        /*!< the last RTC_BKP register of secure protection zoneb is RTC_BKP19, if zoneb is valid */

/* RTC interrupt source */
#define RTC_INT_TIMESTAMP                  RTC_CTL_TSIE                                /*!< time-stamp interrupt enable */
#define RTC_INT_ALARM0                     RTC_CTL_ALRM0IE                             /*!< RTC alarm0 interrupt enable */
#define RTC_INT_ALARM1                     RTC_CTL_ALRM1IE                             /*!< RTC alarm1 interrupt enable */
#define RTC_INT_TAMP                       RTC_TAMP_TPIE                               /*!< tamper detection interrupt enable */
#define RTC_INT_WAKEUP                     RTC_CTL_WTIE                                /*!< RTC wakeup timer interrupt enable */

/* write protect key */
#define RTC_UNLOCK_KEY1                    ((uint8_t)0xCAU)                            /*!< RTC unlock key1 */
#define RTC_UNLOCK_KEY2                    ((uint8_t)0x53U)                            /*!< RTC unlock key2 */
#define RTC_LOCK_KEY                       ((uint8_t)0xFFU)                            /*!< RTC lock key */

/* registers reset value */
#define RTC_REGISTER_RESET                 ((uint32_t)0x00000000U)                     /*!< RTC common register reset value */
#define RTC_DATE_RESET                     ((uint32_t)0x00002101U)                     /*!< RTC_DATE register reset value */
#define RTC_ICS_RESET                     ((uint32_t)0x00000000U)                      /*!< RTC_ICS register reset value */
#define RTC_PSC_RESET                      ((uint32_t)0x007F00FFU)                     /*!< RTC_PSC register reset value */
#define RTC_WUT_RESET                      ((uint32_t)0x0000FFFFU)                     /*!< RTC_WUT register reset value */
#define RTC_SPM_CTL_RESET                  ((uint32_t)0x0000F00FU)                     /*!< RTC_SPM_CTL register reset value */

