CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_rtc.h
/* RTC alarm */
#define RTC_ALARM0                         ((uint8_t)0x01U)                            /*!< RTC alarm 0 */              
#define RTC_ALARM1                         ((uint8_t)0x02U)                            /*!< RTC alarm 1 */   

/* RTC coarse calibration direction */
#define CALIB_INCREASE                     ((uint8_t)0x01U)                            /*!< RTC coarse calibration increase */  
#define CALIB_DECREASE                     ((uint8_t)0x02U)                            /*!< RTC coarse calibration decrease */  

/* RTC flags */
#define RTC_FLAG_ICSRM                     ((uint32_t)0x80000000U)                     /*!< the flag marker for those defined in RTC_ICS */
#define RTC_FLAG_ALARM0W                   (RTC_FLAG_ICSRM | RTC_ICS_ALRM0WF)          /*!< alarm0 configuration can be write flag */
#define RTC_FLAG_ALARM1W                   (RTC_FLAG_ICSRM | RTC_ICS_ALRM1WF)          /*!< alarm1 configuration can be write flag */
#define RTC_FLAG_WTW                       (RTC_FLAG_ICSRM | RTC_ICS_WTWF)             /*!< wakeup timer can be write flag */
#define RTC_FLAG_SOP                       (RTC_FLAG_ICSRM | RTC_ICS_SOPF)             /*!< shift function operation pending flag */
#define RTC_FLAG_YCM                       (RTC_FLAG_ICSRM | RTC_ICS_YCM)              /*!< year configuration mark status flag */
#define RTC_FLAG_RSYN                      (RTC_FLAG_ICSRM | RTC_ICS_RSYNF)            /*!< register synchronization flag */
#define RTC_FLAG_INIT                      (RTC_FLAG_ICSRM | RTC_ICS_INITF)            /*!< initialization state flag */
#define RTC_FLAG_SCP                       (RTC_FLAG_ICSRM | RTC_ICS_SCPF)             /*!< smooth calibration pending flag */
#define RTC_FLAG_ALARM0                    RTC_STAT_ALRM0F                             /*!< alarm0 occurs flag */
#define RTC_FLAG_ALARM1                    RTC_STAT_ALRM1F                             /*!< alarm1 occurs flag */
#define RTC_FLAG_WT                        RTC_STAT_WTF                                /*!< wakeup timer occurs flag */
#define RTC_FLAG_TS                        RTC_STAT_TSF                                /*!< time-stamp flag */
#define RTC_FLAG_TSOVR                     RTC_STAT_TSOVRF                             /*!< time-stamp overflow flag */
#define RTC_FLAG_TP0                       RTC_STAT_TP0F                               /*!< RTC tamper 0 detected flag */
#define RTC_FLAG_TP1                       RTC_STAT_TP1F                               /*!< RTC tamper 1 detected flag */

/* function declarations */
/* reset most of the RTC registers */
ErrStatus rtc_deinit(void);
/* initialize RTC registers */
ErrStatus rtc_init(rtc_parameter_struct* rtc_initpara_struct);
/* enter RTC init mode */
ErrStatus rtc_init_mode_enter(void);
/* exit RTC init mode */
void rtc_init_mode_exit(void);
/* wait until RTC_TIME and RTC_DATE registers are synchronized with APB clock, and the shadow registers are updated */
ErrStatus rtc_register_sync_wait(void);

/* get current time and date */
void rtc_current_time_get(rtc_parameter_struct* rtc_initpara_struct);
/* get current subsecond value */
uint32_t rtc_subsecond_get(void);

/* configure RTC alarm */
void rtc_alarm_config(uint8_t rtc_alarm, rtc_alarm_struct* rtc_alarm_time);
/* configure subsecond of RTC alarm */
void rtc_alarm_subsecond_config(uint8_t rtc_alarm, uint32_t mask_subsecond, uint32_t subsecond);
/* get RTC alarm */
void rtc_alarm_get(uint8_t rtc_alarm,rtc_alarm_struct* rtc_alarm_time);
/* get RTC alarm subsecond */
uint32_t rtc_alarm_subsecond_get(uint8_t rtc_alarm);
/* enable RTC alarm */
void rtc_alarm_enable(uint8_t rtc_alarm);
/* disable RTC alarm */
ErrStatus rtc_alarm_disable(uint8_t rtc_alarm);

/* enable RTC time-stamp */
void rtc_timestamp_enable(uint32_t edge);
/* disable RTC time-stamp */
void rtc_timestamp_disable(void);
/* get RTC timestamp time and date */
void rtc_timestamp_get(rtc_timestamp_struct* rtc_timestamp);
/* get RTC time-stamp subsecond */
uint32_t rtc_timestamp_subsecond_get(void);

/* enable RTC tamper */
void rtc_tamper_enable(rtc_tamper_struct* rtc_tamper);
/* disable RTC tamper */
void rtc_tamper_disable(uint32_t source);
/* reset the RTC_BKP registers by sofware */
void rtc_software_bkp_reset(void);
/* tamperx event does not erase the RTC_BKP registers */
void rtc_tamper_without_bkp_seset(uint32_t ne_source);

/* enable specified RTC interrupt */
void rtc_interrupt_enable(uint32_t interrupt);
/* disble specified RTC interrupt */
void rtc_interrupt_disable(uint32_t interrupt);
/* check specified flag */
FlagStatus rtc_flag_get(uint32_t flag);
/* clear specified flag */
void rtc_flag_clear(uint32_t flag);
/* get specified non-secure interrupt flag */
FlagStatus rtc_nsec_interrupt_flag_get(uint32_t int_flag);
/* clear specified non-secure interrupt flag */
void rtc_nsec_interrupt_flag_clear(uint32_t int_flag);
/* get specified secure interrupt flag */
FlagStatus rtc_sec_interrupt_flag_get(uint32_t int_flag);
/* clear specified secure interrupt flag */
void rtc_sec_interrupt_flag_clear(uint32_t int_flag);

/* select the RTC output pin pad */
void rtc_output_pad_select(uint32_t pad);
/* configure RTC alarm output source */
void rtc_alarm_output_config(uint32_t source, uint32_t mode);
/* configure RTC calibration output source */
void rtc_calibration_output_config(uint32_t source);

/* adjust the daylight saving time by adding or substracting one hour from the current time */
void rtc_hour_adjust(uint32_t operation);
/* adjust RTC second or subsecond value of current time */
ErrStatus rtc_second_adjust(uint32_t add, uint32_t minus);

/* enable RTC bypass shadow registers function */
void rtc_bypass_shadow_enable(void);
/* disable RTC bypass shadow registers function */
void rtc_bypass_shadow_disable(void);

/* enable RTC reference clock detection function */
ErrStatus rtc_refclock_detection_enable(void);
/* disable RTC reference clock detection function */
ErrStatus rtc_refclock_detection_disable(void);

/* enable RTC wakeup timer */
void rtc_wakeup_enable(void);
/* disable RTC wakeup timer */
ErrStatus rtc_wakeup_disable(void);
/* set auto wakeup timer clock */
ErrStatus rtc_wakeup_clock_set(uint8_t wakeup_clock);
/* set auto wakeup timer value */
ErrStatus rtc_wakeup_timer_set(uint16_t wakeup_timer);
/* get auto wakeup timer value */
uint16_t rtc_wakeup_timer_get(void);

/* configure RTC smooth calibration */
ErrStatus rtc_smooth_calibration_config(uint32_t window, uint32_t plus, uint32_t minus);
/* enable RTC coarse calibration */
ErrStatus rtc_coarse_calibration_enable(void);
/* disable RTC coarse calibration */
ErrStatus rtc_coarse_calibration_disable(void);
/* configure RTC coarse calibration direction and step */
ErrStatus rtc_coarse_calibration_config(uint8_t direction, uint8_t step);

/* enable RTC privilege protection mode */
void rtc_pri_pro_enable(uint32_t sub_area);
/* disable RTC privilege protection mode */
void rtc_pri_pro_disable(uint32_t sub_area);
/* enable RTC secure protection mode */
void rtc_sec_pro_enable(uint32_t sub_area);
/* disable RTC secure protection mode */
void rtc_sec_pro_disable(uint32_t sub_area);
/* set the RTC_BKP secure protection zonea tail value */
void rtc_bkp_zonea_sec_pro_set(uint32_t zonea_tail);
/* set the RTC_BKP secure protection zoneb tail value */
ErrStatus rtc_bkp_zoneb_sec_pro_set(uint32_t zoneb_tail);
/* check the RTC_BKP secure protection zoneb is valid or not*/
ErrStatus rtc_bkp_zoneb_sec_pro_check(void);

#endif /* GD32W51X_RTC_H */
